dimitarm1/stm_flash_prj/STM32F0_Discovery_IO_Toggle/src/main.c
			}
		}
	}
	if(prev_status != curr_status){
		if (curr_status == STATUS_WORKING){
			if(controller_address != 15){
				work_hours[2]+=main_time;
				if(work_hours[2]>59L){
					work_hours[2]=work_hours[2]-60;
					work_hours[1]++;
					if(work_hours[1]>99L){
						work_hours[1] = 0;
						work_hours[0]++;
					}
				}
				write_eeprom();
			}

			percent_aquafresh = 0, percent_licevi = 100L, percent_fan2 = 100L;
			zero_crossed = 0;
//			volume_level = 6;
			fan_level = 7;
			percent_fan1 = fan_level;
			set_lamps(100);
//			zero_crossed = 0;
			startup_delay = 2000;
//			set_colarium_lamps(100);
//			set_fan1(percent_fan1);
//			set_fan2(percent_fan2);
//			set_aquafresh(percent_aquafresh);
			play_message(message_start_working);
			set_volume(volume_level);
		}
		if (curr_status == STATUS_COOLING){
			if(controller_address == 15){
				work_hours[2]+=abs(main_time);
				if(work_hours[2]>59L){
					work_hours[2]=work_hours[2]-60;
					work_hours[1]++;
					if(work_hours[1]>99L){
						work_hours[1] = 0;
						work_hours[0]++;
					}
				}
				write_eeprom();
				play_message(message_stop_working);
			}
			percent_licevi = 0, percent_fan1 = 10L, percent_fan2 = 100L;
			percent_aquafresh = 0;
			aqua_fresh_level = 0;
			zero_crossed = 0;
			set_lamps(0);
//			zero_crossed = 0;
			stop_delay = 1000;
//			set_colarium_lamps(0);
			fan_level = 10;
			set_fan1(percent_fan1);
			set_fan2(percent_fan2);
			set_aquafresh(0);
			flash_mode = 3;

		}
		if (curr_status == STATUS_FREE){
			percent_aquafresh = 0, percent_licevi = 0, percent_fan1 = 0, percent_fan2 = 0;
			aqua_fresh_level = 0;
			//				set_lamps(0);
			//set_colarium_lamps(0);
			set_fan1(0);
			set_fan2(0);
//			set_aquafresh(percent_aquafresh);
			minute_counter = 0;
			flash_mode = 0;
			GPIOC->BSRR =  GPIO_BSRR_BS_3; // Internal sound
		}
		prev_status = curr_status;

	}
	//    LED1_OFF;

}



/**
 * @brief  Add a delay using the Systick
 * @param  nTime Delay in milliseconds.
 * @retval None
 */
void SystickDelay(__IO uint32_t nTime)
{

	Gv_SystickCounter = nTime;
	while (Gv_SystickCounter != 0)
	{
		// The Gv_SystickCounter variable is decremented every ms by the Systick interrupt routine
	}

}

void update_status(void){
	if(pre_time) {
		curr_time = pre_time;
		curr_status = STATUS_WAITING;
	}
	else if(main_time) {
		curr_time = main_time;
		curr_status = STATUS_WORKING;
	}
	else if(cool_time) {
		curr_time = cool_time;
		curr_status = STATUS_COOLING;
	}
	else {
		curr_time = 0;
		curr_status = STATUS_FREE;
	}
}
void TimingDelay_Decrement(void)
{
	if (systick_prescaler )
	{
		systick_prescaler--;
	}
	else
	{
		systick_prescaler = 10;
		if (Gv_SystickCounter != 0x00)
		{
			Gv_SystickCounter--;
		}
		if( ++ refresh_counter>200L){
			refresh_counter = 0;
			flash_counter++;
		}
		if(aqua_fresh_level == 1){
			if(Gv_miliseconds>59000L ){
				set_aquafresh(1);
			}
			else {
				set_aquafresh(0);
			}
		}
		else if(aqua_fresh_level == 2){
			if(Gv_miliseconds %15000 >14000L ){
				set_aquafresh(1);
			}
			else {
				set_aquafresh(0);
			}
		}
		else {
			set_aquafresh(0);
		}
		if(Gv_miliseconds++>60000L){
			Gv_miliseconds = 0;
			if (pre_time)pre_time--;
			else if (main_time) {
				main_time--;
				minute_counter ++;
			}
			else if (cool_time) cool_time--;
			update_status();
		}
		if  (Gv_UART_Timeout){
			Gv_UART_Timeout--;
			if(! Gv_UART_Timeout) {
				rx_state = 0;
				pre_time_sent = 0, main_time_sent = 0, cool_time_sent = 0;
			}
		}
		if(startup_delay)
		{
			startup_delay--;
		}
		if(stop_delay)
		{
			stop_delay--;
		}
	//	if(zero_crossed) zero_crossed-=10;
	//	if(percent_fan1) set_fan1(zero_crossed && (!(zero_crossed > percent_fan1)));
	}
	if(pwm_cnt<PWM_START_DELAY + PWM_END_DELAY + PWM_LENGTH)
	{

		if(tim_base  == pwm_cnt && fan1_level)
		{
			GPIOA->BSRR = GPIO_BSRR_BS_3;
		}
		pwm_cnt++;
	}
	else
	{
		if(fan1_level < 100)
		{
			GPIOA->BSRR = GPIO_BSRR_BR_3;
		}
	}
}


void read_eeprom(void){
	int index = 0;
	flash_struct *flash_mem;
	while((eeprom_array[index]!=0xFFFFFFFFUL)&&(index<(512)))index+=(sizeof(flash_struct)/sizeof(uint32_t));
//	for (i = 0; i< 512; i+=2){
//		val = *pMem;
//		if (val == 0xffffffff) break;
//		pMem++;
//	}
//	index = i;
	if(index > 511){
			index = 0;
	}
	if(index == 0){
		// Load defaults
		flash_mem = 0;
		preset_pre_time = 7;
		preset_cool_time = 3;
		work_hours[0] = 0;
		work_hours[1] = 0;
		work_hours[2] = 0;
		volume_message = 5;
		temperature_threshold = 90;
		return;
	}
	index-=sizeof(flash_struct)/sizeof(uint32_t);
	flash_mem = (flash_struct*)&eeprom_array[index];
	preset_pre_time = flash_mem->settings.pre_time ;
	preset_cool_time = flash_mem->settings.cool_time;
	controller_address = flash_mem->settings.addresse & 0x0f;
	work_hours[0] = flash_mem->time.hours_h;
	work_hours[1] = flash_mem->time.hours_l;
	work_hours[2] = flash_mem->time.minutes;
	volume_message = flash_mem->settings.volume_dac;
	temperature_threshold = flash_mem->settings.temperatue_max;
}

void write_eeprom(void){
	int index = 0;
	FLASH_Unlock();
	volatile flash_struct flash_mem;
	uint32_t *p = (uint32_t *)&flash_mem;
	while((eeprom_array[index]!=0xFFFFFFFFUL)&&(index<(512)))index+=3;
	if(index > 511){
		// No more room. Erase the 4 pages
		FLASH_ErasePage((uint32_t)&eeprom_array[0]);
		FLASH_ErasePage((uint32_t)&eeprom_array[128]);
		FLASH_ErasePage((uint32_t)&eeprom_array[256]);
		FLASH_ErasePage((uint32_t)&eeprom_array[384]);
		index = 0;
	}
	while((eeprom_array[index]!=0xFFFFFFFFUL)&&(index<(512)))index+=2;
	if(index >511){
		display_data = 0xE01;
	} else {
		volatile static FLASH_Status sts;
		flash_mem.settings.pre_time = preset_pre_time;
		flash_mem.settings.cool_time = preset_cool_time;
		flash_mem.settings.addresse = controller_address & 0x0f;
		flash_mem.settings.unused_2 = 0x55;
		flash_mem.time.hours_h = work_hours[0];
		flash_mem.time.hours_l = work_hours[1];
		flash_mem.time.minutes = work_hours[2];
		flash_mem.time.used_flag = 0;
		flash_mem.settings.volume_dac = volume_message;
		flash_mem.settings.temperatue_max = temperature_threshold;
		sts = FLASH_ProgramWord((uint32_t)&eeprom_array[index],p[0]);
		sts = FLASH_ProgramWord((uint32_t)&eeprom_array[index+1],p[1]);
		index = sizeof(flash_mem);
		index ++;
		if (sts){
			// Debug code here...
		}
	}
	FLASH_Lock();
}
void set_start_out_signal(int value){
	if (value)	GPIOA->BSRR = GPIO_BSRR_BS_9;
		else GPIOA->BRR = GPIO_BSRR_BS_9;
}

void set_lamps(int value){
	if(!(GPIOC->ODR & GPIO_BSRR_BS_9) == !value) return;
	else
	{
		int counter = 100000;
		while(!zero_crossed && counter)
		{
			counter--;
		}
		if (value)	GPIOC->BSRR = GPIO_BSRR_BS_9;
		else GPIOC->BRR = GPIO_BRR_BR_9;
	}
}
void set_colarium_lamps(int value){
	if(!(GPIOC->ODR & GPIO_BSRR_BS_8) == !value) return;
	else
	{
		int counter = 100000;
		while(!zero_crossed && counter)
		{
			counter--;
		}
		if (value)	GPIOC->BSRR = GPIO_BSRR_BS_8;
		else GPIOC->BRR = GPIO_BRR_BR_8;
	}
}
void set_fan2(int value){
	if (value)
		GPIOC->BSRR = GPIO_BSRR_BS_14;
	else
		GPIOC->BSRR = GPIO_BSRR_BR_14;
}

